
## Plan Result (perftest)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_access_key
* Replace
  * module.adoption-web-session-storage.azurerm_private_endpoint.this[0]
  * module.adoption-web-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://adoption-perftest.vault.azure.net/secrets/redis-access-key/185bb04f6fd14c1cace281a76e92827a"
        name                    = "redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.adoption-web-session-storage.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/adoption-web-session-storage-cache-perftest/providers/Microsoft.Network/privateEndpoints/adoption-web-session-storage-perftest" -> (known after apply)
        name                          = "adoption-web-session-storage-perftest"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/adoption-web-session-storage-cache-perftest/providers/Microsoft.Network/networkInterfaces/adoption-web-session-storage-perftest.nic.aeca5a77-8b2c-4045-bf76-2693686a3ad8"
              - name = "adoption-web-session-storage-perftest.nic.aeca5a77-8b2c-4045-bf76-2693686a3ad8"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/adoption-web-session-storage-cache-perftest/providers/Microsoft.Network/privateEndpoints/adoption-web-session-storage-perftest/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "adoption-web-session-storage-perftest.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.112.136.21",
                        ]
                      - name         = "adoption-web-session-storage-perftest"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "application"         = "adoption"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/adoption-web.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#adoption-tech"
            "environment"         = "testing"
            "managedBy"           = "Adoption"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/adoption-web-session-storage-cache-perftest/providers/Microsoft.Network/privateEndpoints/adoption-web-session-storage-perftest/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "adoption-web-session-storage-perftest"
          ~ private_connection_resource_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/adoption-web-session-storage-cache-perftest/providers/Microsoft.Cache/redis/adoption-web-session-storage-perftest" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.112.136.21" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.adoption-web-session-storage.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                             = "P" -> "C"
      ~ hostname                           = "adoption-web-session-storage-perftest.redis.cache.windows.net" -> (known after apply)
      ~ id                                 = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/adoption-web-session-storage-cache-perftest/providers/Microsoft.Cache/redis/adoption-web-session-storage-perftest" -> (known after apply)
        name                               = "adoption-web-session-storage-perftest"
      ~ port                               = 6379 -> (known after apply)
      ~ primary_access_key                 = (sensitive value)
      ~ primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      ~ redis_version                      = "6.0" -> "6"
      ~ replicas_per_master                = 0 -> (known after apply)
      ~ replicas_per_primary               = 0 -> (known after apply)
      ~ secondary_access_key               = (sensitive value)
      ~ secondary_connection_string        = (sensitive value)
      - shard_count                        = 0 -> null
      ~ sku_name                           = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                           = 6380 -> (known after apply)
        tags                               = {
            "application"         = "adoption"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/adoption-web.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#adoption-tech"
            "environment"         = "testing"
            "managedBy"           = "Adoption"
        }
      - tenant_settings                    = {} -> null
      - zones                              = [] -> null
        # (8 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 7500 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 3276 -> 642
          ~ maxmemory_delta                         = 3276 -> 642
          ~ maxmemory_reserved                      = 3276 -> 642
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (9 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1733,"Program":"tfcmt","SHA1":"","Target":"perftest","Vars":{}} -->